{
  "latest_resources": [
    {
      "title": "An Awesome Tallgrass Church",
      "date": "February 23, 2020",
      "content": "What would an awesome church be like? Big production? Small groups? Great band? Dynamic speaker? We all have things we're looking for in a church - some compatible and some not. But what does God think?"
    },
    {
      "title": "Good News of Great Joy for Young and Old Alike",
      "date": "December 29, 2019",
      "content": "What will you be like when you grow older? Growing old well doesn't happen by accident. It's far more than just time. It takes preparation. It takes investment."
    },
    {
      "title": "Tangible Jesus",
      "date": "November 17, 2019",
      "content": "What's the most primal and basic human sense? It's touch. From the womb, we long to connect with others through touch. But we live in a culture where experiencing healthy human touch is increasingly difficult because of the distancing influence of technology and hypersexualization."
    }
  ],
  "latest_news": [
    {
      "title": "Messianic Passover Seder via Zoom",
      "date": "April 7, 2020",
      "content": "The Deaver LIFE Group does a Messianic Passover Seder each year on Passover (if possible). This year we're taking it to Zoom. Feel free to Zoom in with us on Wednesday, April 8th, 2020 from 6:30-8:00pm CST (request Zoom link from Ben Deaver) OR do your own Messianic Passover Seder with your family."
    },
    {
      "title": "COVID-19 Community Resources",
      "date": "April 3, 2020",
      "content": "Here's a Community Resources document that we got from USD 383 that may be helpful to you and your famly, friends, and/or neighbors. See attachment for the same document."
    },
    {
      "title": "Praying & Sending Out Zach, Jenna, & Terrence",
      "date": "February 23, 2020",
      "content": "Saying goodbye and sending out members of our family is hard. But it's a part of life, especially here in Manhattan, KS. This last Sunday we had the privilege to hear from three of our own, Zach Breshears, Jenna Park, and Terrence Thomas, about what they're taking with them from their time with us at Tallgrass and what God's leading them to next. Then we were able to gather around these brothers and sister in prayer."
    }
  ],
  "upcoming_events": [
    {
      "title": "Celebrating Two Years ",
      "date": "April 19, 2020",
      "time": "10:00-11:00 AM"
    },
    {
      "title": "Tallgrass Prayer via Zoom ",
      "date": "April 21, 2020",
      "time": "6:30-7:30 AM"
    },
    {
      "title": "Walk for Life ",
      "date": "May 30, 2020",
      "time": "9:00-10:00 AM"
    },
    {
      "title": "Tallgrass Prayer via Zoom ",
      "date": "May 31, 2020",
      "time": "6:30-7:30 AM"
    }
  ]
}
